Tekla Open API Reference for Tekla Structures 2025
Profile Methods
The PartFilterExpressions.Profile type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
PartFilterExpressions.Profile Class
Tekla.Structures.Filtering.Categories Namespace